Moving diagrams to D2
